<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1ce508b98202c7d29a025cd0987183ad4ba9fcec87bce1d14c14904e2b5885d0","plan_job_ref":"Job Run Terraform plan in staging #235 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14622497128","plan_out_hash":"98fa27bdae7ecb63142f33cb57206a2b21d745ffeedfe56825273d7ab9af6720","plan_hash":"7fa1c88941cac6bb2e940c603f5886d4f6adc43015d60d315e9204827583c4ad","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
+           {
+               destination_app = (known after apply)
+               port            = "61443"
+               protocol        = "tcp"
+               source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
            },
+           {
+               destination_app = (known after apply)
+               port            = "8080"
+               protocol        = "tcp"
+               source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
            },
        ]
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = true -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "175a3a43404fb2a33deaf8fba9e461a196ec830fb1991f4dffac53a6504ffcc8" -> "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-27T21:01:27Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-               app_process_type = "web" -> null
-               id               = "d6379a2c-eeae-4972-999d-7ac2b758479f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "c5387ea1-136d-4856-85a2-2c9f68e7aa2e"
!~      updated_at   = "2025-03-27T20:33:06Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #235](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14622497128)